--Добавление исходных данных

INSERT INTO products VALUES 
	(3251615, 'Стол кухонный', 'белый', 8000, 12),
	(3251616, 'Стол кухонный', NULL, 8000, 15),
	(3251617, 'Стул столовый "гусарский"', 'орех', 4000, 0),
	(3251619, 'Стул столовый с высокой спинкой', 'белый', 3500, 37),
	(3251620, 'Стул столовый с высокой спинкой', 'коричневый', 3500, 52);

INSERT INTO orders (create_date,
                    customer_name,
                    customer_number,
                    customer_email,
                    delivery_address,
                    delivery_status,
                    delivery_datestart)
VALUES
	('2020-11-20', 'Иванов Сергей','(981)123-45-67', NULL, 'ул. Веденеева, 20-1-41', 'S', '2020-11-29'),
	('2020-11-22', 'Комаров Алексей','(921)001-22-33', NULL, 'пр. Пархоменко 51-2-123', 'S', '2020-11-29'),
	('2020-11-28', 'Ирина Викторова','(911)009-88-77', NULL, 'Тихорецкий пр. 21-21', 'P', NULL),
	('2020-12-03', 'Николаев Павел',NULL, 'pasha_nick@mail.ru', 'ул. Хлопина 3-88', 'P', NULL),
	('2020-12-03', 'Антонина Васильева','(931)777-66-55', 'antvas66@gmail.com', 'пр. Науки, 11-3-9', 'P', NULL),
	('2020-12-10', 'Ирина Викторова','(911)009-88-77', NULL, 'Тихорецкий пр. 21-21', 'P', NULL);

INSERT INTO order_position VALUES 
	(1, 3251616, 7500, 1),
	(2, 3251615, 7500, 1),
	(3, 3251615, 8000, 1),
	(3, 3251617, 4000, 4),
	(4, 3251619, 3500, 2),
	(5, 3251615, 8000, 1),
	(5, 3251617, 4000, 4),
	(6, 3251617, 4000, 2);